namespace Enterprise.DocumentEngine.MacroValueProviders.Utilities.Testing
{
	sealed class NumberToString_BG_BGTest : NumberToWordsTestCase
	{
		public void TestGetNumberAsString()
		{
			CombineAssertions(delegate
			{
				Assert(0, "нула");
				Assert(1, "едно");
				Assert(2, "две");
				Assert(3, "три");
				Assert(4, "четири");
				Assert(5, "пет");
				Assert(6, "шест");
				Assert(7, "седем");
				Assert(8, "осем");
				Assert(9, "девет");
				Assert(10, "десет");
				Assert(11, "единадесет");
				Assert(12, "дванадесет");
				Assert(13, "тринадесет");
				Assert(14, "четиринадесет");
				Assert(15, "петнадесет");
				Assert(16, "шестнадесет");
				Assert(17, "седемнадесет");
				Assert(18, "осемнадесет");
				Assert(19, "деветнадесет");
				Assert(20, "двадесет");
				Assert(21, "двадесет и едно");
				Assert(22, "двадесет и две");
				Assert(23, "двадесет и три");
				Assert(25, "двадесет и пет");
				Assert(26, "двадесет и шест");
				Assert(30, "тридесет");
				Assert(31, "тридесет и едно");
				Assert(40, "четиридесет");
				Assert(43, "четиридесет и три");
				Assert(50, "петдесет");
				Assert(54, "петдесет и четири");
				Assert(55, "петдесет и пет");
				Assert(60, "шестдесет");
				Assert(67, "шестдесет и седем");
				Assert(70, "седемдесет");
				Assert(79, "седемдесет и девет");
				Assert(80, "осемдесет");
				Assert(90, "деветдесет");
				Assert(100, "сто");
				Assert(101, "сто и едно");
				Assert(112, "сто и дванадесет");
				Assert(150, "сто и петдесет");
				Assert(157, "сто петдесет и седем");
				Assert(199, "сто деветдесет и девет");
				Assert(200, "двеста");
				Assert(203, "двеста и три");
				Assert(231, "двеста тридесет и едно");
				Assert(287, "двеста осемдесет и седем");
				Assert(300, "триста");
				Assert(356, "триста петдесет и шест");
				Assert(400, "четиристотин");
				Assert(410, "четиристотин и десет");
				Assert(434, "четиристотин тридесет и четири");
				Assert(500, "петстотин");
				Assert(578, "петстотин седемдесет и осем");
				Assert(600, "шестстотин");
				Assert(689, "шестстотин осемдесет и девет");
				Assert(700, "седемстотин");
				Assert(729, "седемстотин двадесет и девет");
				Assert(800, "осемстотин");
				Assert(894, "осемстотин деветдесет и четири");
				Assert(900, "деветстотин");
				Assert(999, "деветстотин деветдесет и девет");
				Assert(1000, "хиляда");
				Assert(1001, "хиляда и едно");
				Assert(1063, "хиляда и шестдесет и три");
				Assert(1097, "хиляда и деветдесет и седем");
				Assert(1104, "хиляда сто и четири");
				Assert(1243, "хиляда двеста четиридесет и три");
				Assert(1876, "хиляда осемстотин седемдесет и шест");
				Assert(2385, "две хиляди триста осемдесет и пет");
				Assert(3766, "три хиляди седемстотин шестдесет и шест");
				Assert(4196, "четири хиляди сто деветдесет и шест");
				Assert(5846, "пет хиляди осемстотин четиридесет и шест");
				Assert(6459, "шест хиляди четиристотин петдесет и девет");
				Assert(7232, "седем хиляди двеста тридесет и две");
				Assert(8569, "осем хиляди петстотин шестдесет и девет");
				Assert(9539, "девет хиляди петстотин тридесет и девет");
				Assert(2012, "две хиляди и дванадесет");
			});
		}

		internal override INumberToWords GetInstance()
		{
			return new NumberToString_BG_BG();
		}
	}
}
