
namespace Enterprise.Accounting.DataTransfer.DataInterface.ChinaStandard_GBT19581_2004
{
	public static class GSSMFile
	{
		[System.Diagnostics.CodeAnalysis.SuppressMessage("CargoWiseOne", "CW1161:ResGetStringAnalyzer", Justification = "China Standard 2004 string.")]
		public const string Gssm =
			@"[电子账簿]
DZZB.TXT
电子账簿编号,C..5
电子账簿名称,C..60
会计核算单位,C..60
组织机构代码,C..20
单位性质,C8
行业,C..20
开发单位,C..60
版本号,C..20
年度,C4
本位币,C..14
科目结构,C..30
[会计科目]
KJKM.TXT
科目编号,C..30
科目名称,C..60
科目级次,I..2
辅助核算标志,C1
辅助核算项,C..60
科目类型,C..20
计量单位,C..10
余额方向,C..4
[辅助核算项档案]
部门
单位
员工
[部门]
BMXX.TXT
部门编号,C..20
部门名称,C..40
上级部门编号, C..20
[单位]
WLDW.TXT
单位编号,C..30
单位名称,C..60
类别编号,C..20
地区,C..40
电话,C..20
地址,C..60
信用等级, C..6
[员工]
YGXX.TXT
人员编号,C..20
人员姓名,C..20
证件类别,C..12
证件号码,C..30
性别,C2
出生日期,C8
部门编号,C..20
入职日期,C8
离职日期,C8
[科目余额及发生额]
KMYE.TXT
科目编号,C..30
币种,C..14
辅助核算组,C..255
期初余额,D20.2
期初数量, D20.2
期初外币余额, D20.2
借方发生额, D18.2
借方发生数量, D18.2
借方外币发生额, D18.2
贷方发生额, D18.2
贷方发生数量, D18.2
贷方外币发生额, D18.2
期末余额, D20.2
期末数量, D20.2
期末外币余额, D20.2
会计月度,C2
[记账凭证]
JZPZ.TXT
凭证日期,C8
凭证种类, C..12
凭证编号, C..20
行号, I..5
摘要, C..100
科目编号,C..30
借方金额, D18.2
贷方金额, D18.2
币种,C..14
借方外币金额, D18.2
贷方外币金额, D18.2
汇率，D13.6
数量,D15.4
单价, D18.4
辅助核算组,C..255
结算方式,C..20
票据类型,C..20
票据号,C..30
票据日期,C8
附件数,I..4
制单人员，C..20
审核人员，C..20
记账人员，C..20
出纳人员，C..20
结账标志，C1
作废标志, C1
[企业资产负债表]
Q_ZCFZ.TXT
报表编号，C..20
编制单位，C..60
报告日，C..8
货币单位，C..10
项目，C..60
行次，C..3
年初数, D20.2
期末数, D20.2
[企业利润表]
Q_LR.TXT
报表编号,C..20
编制单位,C..60
报告期,C..8
货币单位,C..10
项目,C..60
行次,C..3
本月数, D20.2
本年累计数, D20.2
[企业现金流量表]
Q_XJLL.TXT
报表编号, C..20
编制单位, C..60
报告期, C..8
货币单位, C..10
项目, C..60
行次, C..3
金额, D20.2
[企业应交增值税明细表]
Q_ZZS.TXT
报表编号, C..20
编制单位, C..60
报告期, C..8
货币单位, C..10
项目, C..60
行次, C..3
本月数, D20.2
本年累计数, D20.2
[企业资产减值准备明细表]
Q_JZZB.TXT
报表编号, C..20
编制单位, C..60
报告期, C..8
货币单位, C..10
项目, C..60
本年增加数, D20.2
本年转回数, D20.2
年末金额, D20.2
年初余额, D20.2
[企业利润分配表]
Q_LRFP.TXT
报表编号, C..20
编制单位, C..60
报告期, C..8
货币单位, C..10
项目, C..60
行次, C..3
上年实际, D20.2
本年实际, D20.2
[企业股东权益增减变动表]
Q_GDQYBD.TXT
报表编号, C..20
编制单位, C..60
报告期, C..8
货币单位, C..10
项目, C..60
行次, C..3
上年数, D20.2
本年数, D20.2";
	}
}
