using System;
using System.Linq;
using CargoWise.RefDbRepo.CNReferenceData.Business;
using NUnit.Framework;

namespace CargoWise.RefDbRepo.CNReferenceData.Tests
{
	[TestFixture]
	public class RateFormulaParserFixture
	{
		[Test]
		public void TestCorrect()
		{
			var lines = @"0.912元/升
1.2元/L（暂缓实施）
1.2元/L
进口完税价格≥0.3745美元/升的麦芽酿造啤酒，税率为0.253元/升；进口完税价格<0.3745美元/升的麦芽酿造啤酒,税率为0.2227元/升）
每标准条进口完税价格≥50元人民币，45%+150元/标准箱；每标准条进口完税价格＜50元人民币，30%+150元/标准箱
20%+0.912元/升
10%或900元/吨，两者从低。
10%或900.00元，两者从低。
20%或1500元/吨，两者从低。
20%或1500.00元/吨，两者从低。
t1
5%或“完税价格不高于7000美元/台：15%；完税价格高于7000美元/台：5%，加4256元/台”；两者从低执行。
5%与“完税价格不高于7000美元/台：15%；完税价格高于7000美元/台：5%，加4256元/台。”两者从低执行
11.7%或“完税价格不高于5000美元/台：35%；完税价格高于5000美元/台：3%+9728元/台”；从低执行。
完税价格不高于5000美元/台：130%；完税价格高于5000美元/台：6％，加51500元。
完税价格不高于2000美元/台：18.4%；完税价格高于2000美元/台：3％，加1879元
17.5%与“完税价格不高于5000美元/台，35%；完税价格高于5000美元/台：3%，加9728元/台”从低执行
价格≤5000美元/台：26.2%；价格>5000美元/台：2.2%+9720元/台
完税价格不高于2000美元/台：130%；完税价格高于5000美元/台：6％，加20600元。
7.5%与“完税价格不高于2000美元/台：30%；完税价格高于2000美元/台：3%，加3283元/台”从低执行
价格≤2000美元/台：22.5%；价格>2000美元/台：2.2%+3280.5元/台
进口完税价格在10元/毫升（克）及以上的税率为15%
进口完税价格在10元/毫升（克）或15元/片（张）及以上的税率为15%
待更新
完税价格≤ 2000美 元/台： 9.6%； 完税价 格＞ 2000美 元/台： 3.0%+10 67.7元
完税价格≤ 5000美 元/台： 19.2%； 完税价格>5000 美元 /台： 1.6%+71 28元/台
完税价不高于0元/平方米：0%，完税价高于0元/平方米：0%+104元/平方米";

			AssertOutputs(@"0.912[UOM=][CNY]/升
0
1.2[UOM=][CNY]/升
CV>=0.3745[UOM=][USD]/升:0.253[UOM=][CNY]/升;CV<0.3745[UOM=][USD]/升:0.2227[UOM=][CNY]/升
标准条每CV>=50[UOM=][CNY]:45%+150[UOM=][CNY]/标准箱;标准条每CV<50[UOM=][CNY]:30%+150[UOM=][CNY]/标准箱
20%+0.912[UOM=][CNY]/升
10%与900[UOM=][CNY]/吨->MIN
10%与900.00[UOM=][CNY]->MIN
20%与1500[UOM=][CNY]/吨->MIN
20%与1500.00[UOM=][CNY]/吨->MIN
t1
5%与CV<=7000[UOM=][USD]/台:15%;CV>7000[UOM=][USD]/台:5%+4256[UOM=][CNY]/台->MIN
5%与CV<=7000[UOM=][USD]/台:15%;CV>7000[UOM=][USD]/台:5%+4256[UOM=][CNY]/台->MIN
11.7%与CV<=5000[UOM=][USD]/台:35%;CV>5000[UOM=][USD]/台:3%+9728[UOM=][CNY]/台->MIN
CV<=5000[UOM=][USD]/台:130%;CV>5000[UOM=][USD]/台:6%+51500[UOM=][CNY]
CV<=2000[UOM=][USD]/台:18.4%;CV>2000[UOM=][USD]/台:3%+1879[UOM=][CNY]
17.5%与CV<=5000[UOM=][USD]/台:35%;CV>5000[UOM=][USD]/台:3%+9728[UOM=][CNY]/台->MIN
CV<=5000[UOM=][USD]/台:26.2%;CV>5000[UOM=][USD]/台:2.2%+9720[UOM=][CNY]/台
CV<=2000[UOM=][USD]/台:130%;CV>5000[UOM=][USD]/台:6%+20600[UOM=][CNY]
7.5%与CV<=2000[UOM=][USD]/台:30%;CV>2000[UOM=][USD]/台:3%+3283[UOM=][CNY]/台->MIN
CV<=2000[UOM=][USD]/台:22.5%;CV>2000[UOM=][USD]/台:2.2%+3280.5[UOM=][CNY]/台
CV>=10[UOM=][CNY]/克:15%
CV>=10[UOM=][CNY]/克:15%;CV>=15[UOM=][CNY]/件:15%
0
CV<=2000[UOM=][USD]/台:9.6%;CV>2000[UOM=][USD]/台:3.0%+1067.7[UOM=][CNY]
CV<=5000[UOM=][USD]/台:19.2%;CV>5000[UOM=][USD]/台:1.6%+7128[UOM=][CNY]/台
CV<=0[UOM=][CNY]/平方米:0%;CV>0[UOM=][CNY]/平方米:0%+104[UOM=][CNY]/平方米", lines, x => RateFormulaParser.Correct(x));
		}

		[Test]
		public void TestGetFormula()
		{
			var lines = @"0.912元/升
1.2元/L（暂缓实施）
1.2元/L
进口完税价格≥0.3745美元/升的麦芽酿造啤酒，税率为0.253元/升；进口完税价格<0.3745美元/升的麦芽酿造啤酒,税率为0.2227元/升）
每标准条进口完税价格≥50元人民币，45%+150元/标准箱；每标准条进口完税价格＜50元人民币，30%+150元/标准箱
20%+0.912元/升
10%或900元/吨，两者从低。
10%或900.00元，两者从低。
20%或1500元/吨，两者从低。
20%或1500.00元/吨，两者从低。
t1
5%或“完税价格不高于7000美元/台：15%；完税价格高于7000美元/台：5%，加4256元/台”；两者从低执行。
5%与“完税价格不高于7000美元/台：15%；完税价格高于7000美元/台：5%，加4256元/台。”两者从低执行
11.7%或“完税价格不高于5000美元/台：35%；完税价格高于5000美元/台：3%+9728元/台”；从低执行。
完税价格不高于5000美元/台：130%；完税价格高于5000美元/台：6％，加51500元。
完税价格不高于2000美元/台：18.4%；完税价格高于2000美元/台：3％，加1879元
17.5%与“完税价格不高于5000美元/台，35%；完税价格高于5000美元/台：3%，加9728元/台”从低执行
价格≤5000美元/台：26.2%；价格>5000美元/台：2.2%+9720元/台
完税价格不高于2000美元/台：130%；完税价格高于5000美元/台：6％，加20600元。
7.5%与“完税价格不高于2000美元/台：30%；完税价格高于2000美元/台：3%，加3283元/台”从低执行
价格≤2000美元/台：22.5%；价格>2000美元/台：2.2%+3280.5元/台
零国别关税配额税率
国别配额税率：0
关税配 额税 率：15
国别关 税配额 税率： 15
④国别关税配额税率：0
进口完税价格在10元/毫升（克）或15元/片（张）及以上的税率为15%
完税价格≤ 2000美 元/台： 9.6%； 完税价 格＞ 2000美 元/台： 3.0%+10 67.7元
完税价格≤ 5000美 元/台： 19.2%； 完税价格>5000 美元 /台： 1.6%+71 28元/台
完税价不高于0元/平方米：0%，完税价高于0元/平方米：0%+104元/平方米";

			AssertOutputs(@"0.912 * [095]
0
1.2 * [095]
IF(CVINUSD >= 0.3745 * [095], 0.253 * [095], IF(CVINUSD < 0.3745 * [095], 0.2227 * [095], 0))
IF(CV >= 50 * MAX(1, ROUND([143] / 0.2, 0)), VFD * 0.45 + 150 * MAX(1, ROUND([143] / 50, 0)), IF(CV < 50 * MAX(1, ROUND([143] / 0.2, 0)), VFD * 0.3 + 150 * MAX(1, ROUND([143] / 50, 0)), 0))
VFD * 0.2 + 0.912 * [095]
MIN(VFD * 0.1, 900 * [070])
MIN(VFD * 0.1, 900.00)
MIN(VFD * 0.2, 1500 * [070])
MIN(VFD * 0.2, 1500.00 * [070])
t1
MIN(VFD * 0.05, IF(CVINUSD <= 7000 * [001], VFD * 0.15, IF(CVINUSD > 7000 * [001], VFD * 0.05 + 4256 * [001], 0)))
MIN(VFD * 0.05, IF(CVINUSD <= 7000 * [001], VFD * 0.15, IF(CVINUSD > 7000 * [001], VFD * 0.05 + 4256 * [001], 0)))
MIN(VFD * 0.117, IF(CVINUSD <= 5000 * [001], VFD * 0.35, IF(CVINUSD > 5000 * [001], VFD * 0.03 + 9728 * [001], 0)))
IF(CVINUSD <= 5000 * [001], VFD * 1.3, IF(CVINUSD > 5000 * [001], VFD * 0.06 + 51500, 0))
IF(CVINUSD <= 2000 * [001], VFD * 0.184, IF(CVINUSD > 2000 * [001], VFD * 0.03 + 1879, 0))
MIN(VFD * 0.175, IF(CVINUSD <= 5000 * [001], VFD * 0.35, IF(CVINUSD > 5000 * [001], VFD * 0.03 + 9728 * [001], 0)))
IF(CVINUSD <= 5000 * [001], VFD * 0.262, IF(CVINUSD > 5000 * [001], VFD * 0.022 + 9720 * [001], 0))
IF(CVINUSD <= 2000 * [001], VFD * 1.3, IF(CVINUSD > 5000 * [001], VFD * 0.06 + 20600, 0))
MIN(VFD * 0.075, IF(CVINUSD <= 2000 * [001], VFD * 0.3, IF(CVINUSD > 2000 * [001], VFD * 0.03 + 3283 * [001], 0)))
IF(CVINUSD <= 2000 * [001], VFD * 0.225, IF(CVINUSD > 2000 * [001], VFD * 0.022 + 3280.5 * [001], 0))
0
0
VFD * 0.15
VFD * 0.15
0
IF(CV >= 10 * [036], VFD * 0.15, IF(CV >= 15 * [011], VFD * 0.15, 0))
IF(CVINUSD <= 2000 * [001], VFD * 0.096, IF(CVINUSD > 2000 * [001], VFD * 0.03 + 1067.7, 0))
IF(CVINUSD <= 5000 * [001], VFD * 0.192, IF(CVINUSD > 5000 * [001], VFD * 0.016 + 7128 * [001], 0))
IF(CV <= 0 * [032], VFD * 0, IF(CV > 0 * [032], VFD * 0 + 104 * [032], 0))", lines, x => RateFormulaParser.GetRateFormula("", "DTY", x, null));

			AssertOutputs(@"0.912 * [095]
0
1.2 * [095]
IF(CVINUSD >= 0.3745 * [095], 0.253 * [095], IF(CVINUSD < 0.3745 * [095], 0.2227 * [095], 0))
IF(CV >= 50 * MAX(1, ROUND([143] / 0.2, 0)), VFD / (1 - 0.45) * 0.45 + 150 * MAX(1, ROUND([143] / 50, 0)), IF(CV < 50 * MAX(1, ROUND([143] / 0.2, 0)), VFD / (1 - 0.3) * 0.3 + 150 * MAX(1, ROUND([143] / 50, 0)), 0))
VFD / (1 - 0.2) * 0.2 + 0.912 * [095]
MIN(VFD / (1 - 0.1) * 0.1, 900 * [070])
MIN(VFD / (1 - 0.1) * 0.1, 900.00)
MIN(VFD / (1 - 0.2) * 0.2, 1500 * [070])
MIN(VFD / (1 - 0.2) * 0.2, 1500.00 * [070])
t1
MIN(VFD / (1 - 0.05) * 0.05, IF(CVINUSD <= 7000 * [001], VFD / (1 - 0.15) * 0.15, IF(CVINUSD > 7000 * [001], VFD / (1 - 0.05) * 0.05 + 4256 * [001], 0)))
MIN(VFD / (1 - 0.05) * 0.05, IF(CVINUSD <= 7000 * [001], VFD / (1 - 0.15) * 0.15, IF(CVINUSD > 7000 * [001], VFD / (1 - 0.05) * 0.05 + 4256 * [001], 0)))
MIN(VFD / (1 - 0.117) * 0.117, IF(CVINUSD <= 5000 * [001], VFD / (1 - 0.35) * 0.35, IF(CVINUSD > 5000 * [001], VFD / (1 - 0.03) * 0.03 + 9728 * [001], 0)))
IF(CVINUSD <= 5000 * [001], VFD / (1 - 1.3) * 1.3, IF(CVINUSD > 5000 * [001], VFD / (1 - 0.06) * 0.06 + 51500, 0))
IF(CVINUSD <= 2000 * [001], VFD / (1 - 0.184) * 0.184, IF(CVINUSD > 2000 * [001], VFD / (1 - 0.03) * 0.03 + 1879, 0))
MIN(VFD / (1 - 0.175) * 0.175, IF(CVINUSD <= 5000 * [001], VFD / (1 - 0.35) * 0.35, IF(CVINUSD > 5000 * [001], VFD / (1 - 0.03) * 0.03 + 9728 * [001], 0)))
IF(CVINUSD <= 5000 * [001], VFD / (1 - 0.262) * 0.262, IF(CVINUSD > 5000 * [001], VFD / (1 - 0.022) * 0.022 + 9720 * [001], 0))
IF(CVINUSD <= 2000 * [001], VFD / (1 - 1.3) * 1.3, IF(CVINUSD > 5000 * [001], VFD / (1 - 0.06) * 0.06 + 20600, 0))
MIN(VFD / (1 - 0.075) * 0.075, IF(CVINUSD <= 2000 * [001], VFD / (1 - 0.3) * 0.3, IF(CVINUSD > 2000 * [001], VFD / (1 - 0.03) * 0.03 + 3283 * [001], 0)))
IF(CVINUSD <= 2000 * [001], VFD / (1 - 0.225) * 0.225, IF(CVINUSD > 2000 * [001], VFD / (1 - 0.022) * 0.022 + 3280.5 * [001], 0))
0
0
VFD / (1 - 0.15) * 0.15
VFD / (1 - 0.15) * 0.15
0
IF(CV >= 10 * [036], VFD / (1 - 0.15) * 0.15, IF(CV >= 15 * [011], VFD / (1 - 0.15) * 0.15, 0))
IF(CVINUSD <= 2000 * [001], VFD / (1 - 0.096) * 0.096, IF(CVINUSD > 2000 * [001], VFD / (1 - 0.03) * 0.03 + 1067.7, 0))
IF(CVINUSD <= 5000 * [001], VFD / (1 - 0.192) * 0.192, IF(CVINUSD > 5000 * [001], VFD / (1 - 0.016) * 0.016 + 7128 * [001], 0))
IF(CV <= 0 * [032], VFD / (1 - 0) * 0, IF(CV > 0 * [032], VFD / (1 - 0) * 0 + 104 * [032], 0))", lines, x => RateFormulaParser.GetRateFormula("", "EXC", x, null));

			AssertOutputs(@"0.912 * [095]
0
1.2 * [095]
IF(CVINUSD >= 0.3745 * [095], 0.253 * [095], IF(CVINUSD < 0.3745 * [095], 0.2227 * [095], 0))
IF(CV >= 50 * MAX(1, ROUND([143] / 0.2, 0)), ROUND(VFD / (1 + 0.45), 0) * 0.45 + 150 * MAX(1, ROUND([143] / 50, 0)), IF(CV < 50 * MAX(1, ROUND([143] / 0.2, 0)), ROUND(VFD / (1 + 0.3), 0) * 0.3 + 150 * MAX(1, ROUND([143] / 50, 0)), 0))
ROUND(VFD / (1 + 0.2), 0) * 0.2 + 0.912 * [095]
MIN(ROUND(VFD / (1 + 0.1), 0) * 0.1, 900 * [070])
MIN(ROUND(VFD / (1 + 0.1), 0) * 0.1, 900.00)
MIN(ROUND(VFD / (1 + 0.2), 0) * 0.2, 1500 * [070])
MIN(ROUND(VFD / (1 + 0.2), 0) * 0.2, 1500.00 * [070])
t1
MIN(ROUND(VFD / (1 + 0.05), 0) * 0.05, IF(CVINUSD <= 7000 * [001], ROUND(VFD / (1 + 0.15), 0) * 0.15, IF(CVINUSD > 7000 * [001], ROUND(VFD / (1 + 0.05), 0) * 0.05 + 4256 * [001], 0)))
MIN(ROUND(VFD / (1 + 0.05), 0) * 0.05, IF(CVINUSD <= 7000 * [001], ROUND(VFD / (1 + 0.15), 0) * 0.15, IF(CVINUSD > 7000 * [001], ROUND(VFD / (1 + 0.05), 0) * 0.05 + 4256 * [001], 0)))
MIN(ROUND(VFD / (1 + 0.117), 0) * 0.117, IF(CVINUSD <= 5000 * [001], ROUND(VFD / (1 + 0.35), 0) * 0.35, IF(CVINUSD > 5000 * [001], ROUND(VFD / (1 + 0.03), 0) * 0.03 + 9728 * [001], 0)))
IF(CVINUSD <= 5000 * [001], ROUND(VFD / (1 + 1.3), 0) * 1.3, IF(CVINUSD > 5000 * [001], ROUND(VFD / (1 + 0.06), 0) * 0.06 + 51500, 0))
IF(CVINUSD <= 2000 * [001], ROUND(VFD / (1 + 0.184), 0) * 0.184, IF(CVINUSD > 2000 * [001], ROUND(VFD / (1 + 0.03), 0) * 0.03 + 1879, 0))
MIN(ROUND(VFD / (1 + 0.175), 0) * 0.175, IF(CVINUSD <= 5000 * [001], ROUND(VFD / (1 + 0.35), 0) * 0.35, IF(CVINUSD > 5000 * [001], ROUND(VFD / (1 + 0.03), 0) * 0.03 + 9728 * [001], 0)))
IF(CVINUSD <= 5000 * [001], ROUND(VFD / (1 + 0.262), 0) * 0.262, IF(CVINUSD > 5000 * [001], ROUND(VFD / (1 + 0.022), 0) * 0.022 + 9720 * [001], 0))
IF(CVINUSD <= 2000 * [001], ROUND(VFD / (1 + 1.3), 0) * 1.3, IF(CVINUSD > 5000 * [001], ROUND(VFD / (1 + 0.06), 0) * 0.06 + 20600, 0))
MIN(ROUND(VFD / (1 + 0.075), 0) * 0.075, IF(CVINUSD <= 2000 * [001], ROUND(VFD / (1 + 0.3), 0) * 0.3, IF(CVINUSD > 2000 * [001], ROUND(VFD / (1 + 0.03), 0) * 0.03 + 3283 * [001], 0)))
IF(CVINUSD <= 2000 * [001], ROUND(VFD / (1 + 0.225), 0) * 0.225, IF(CVINUSD > 2000 * [001], ROUND(VFD / (1 + 0.022), 0) * 0.022 + 3280.5 * [001], 0))
0
0
ROUND(VFD / (1 + 0.15), 0) * 0.15
ROUND(VFD / (1 + 0.15), 0) * 0.15
0
IF(CV >= 10 * [036], ROUND(VFD / (1 + 0.15), 0) * 0.15, IF(CV >= 15 * [011], ROUND(VFD / (1 + 0.15), 0) * 0.15, 0))
IF(CVINUSD <= 2000 * [001], ROUND(VFD / (1 + 0.096), 0) * 0.096, IF(CVINUSD > 2000 * [001], ROUND(VFD / (1 + 0.03), 0) * 0.03 + 1067.7, 0))
IF(CVINUSD <= 5000 * [001], ROUND(VFD / (1 + 0.192), 0) * 0.192, IF(CVINUSD > 5000 * [001], ROUND(VFD / (1 + 0.016), 0) * 0.016 + 7128 * [001], 0))
IF(CV <= 0 * [032], ROUND(VFD / (1 + 0), 0) * 0, IF(CV > 0 * [032], ROUND(VFD / (1 + 0), 0) * 0 + 104 * [032], 0))", lines, x => RateFormulaParser.GetRateFormula("", "EXP", x, null));
		}

		void AssertOutputs(string expectedOutput, string input, Func<string, string> getResult)
		{
			var expectedOutputLines = expectedOutput.Split(new[] { "\r\n" }, StringSplitOptions.None);
			var inputLines = input.Split(new[] { "\r\n" }, StringSplitOptions.None);

			Assert.Multiple(() =>
			{
				Assert.AreEqual(expectedOutputLines.Length, inputLines.Length);

				for (int i = 0; i < inputLines.Length; i++)
				{
					var actual = getResult(inputLines[i]);
					Assert.AreEqual(expectedOutputLines.ElementAtOrDefault(i), actual, $"#{i}:  {inputLines[i]}\r\nExpected: {expectedOutputLines.ElementAtOrDefault(i)}\r\nActual:   {actual}");
				}
			});
		}
	}
}
